spec/spec/SVAP/AcquiringApplications/Examples/app_flow.example.2015.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:int="http://bpc.ru/sv/SVAP">
<soapenv:Header/>
<soapenv:Body>
<application xmlns="http://sv.bpc.in/SVAP">
    <application_type>APTPACQA</application_type>                                       <!-- Application type - Acquiring -->
    <application_flow_id>2015</application_flow_id>                                     <!-- Application flow (business process) - Change terminal data -->
    <application_status>APST0006</application_status>                                   <!-- Application status - Ready to process -->
    <operator_id>ADMIN</operator_id>                                                	<!-- User name who made this application -->
    <institution_id>1001</institution_id>                                               <!-- Institution identifier -->
    <agent_id>10000001</agent_id>                                                       <!-- Agent identifier -->
    <customer>
        <command>CMMDEXPR</command>                                                     <!-- Command for customer - find existing customer -->
        <customer_number>0000000000000000000697</customer_number>                       <!-- Unique customer number -->
        <contract>
            <command>CMMDEXPR</command>                                                 <!-- Command for contract - find existing contract -->
            <contract_number>00000000000000000000000000000736</contract_number>         <!-- Contract number -->
            <merchant id="merchant_1">
                <command>CMMDEXPR</command>                                             <!-- Find existing parent merchant -->
                <merchant_number>000000070000063</merchant_number>                      <!-- Merchant number -->
                <terminal id="terminal_1">                                              <!-- New terminal registration -->
                    <command>CMMDEXUP</command>                                         <!-- Create new object command -->
					<terminal_number>TERMINAL_2012</terminal_number>
                    <standard_id>1003</standard_id>                                     <!-- Communication standard  -->
                    <version_id>1002</version_id>                                       <!-- Version number -->
                    <mcc>0002</mcc>                                                     <!-- Merchant Category Code -->
                    <terminal_template>10000017</terminal_template>                     <!-- Reference to terminal template -->
                    <terminal_quantity>1</terminal_quantity>
                    <atm_terminal id="atm_1">
                        <atm_type>ATMT0001</atm_type>
                        <serial_number>4568831867</serial_number>
                        <cassette_count>1</cassette_count>
                        <hopper_count>1</hopper_count>
                        <scenario_id>5001</scenario_id>
                        <atm_dispenser id="dispenser_1">
                            <disp_number>1234</disp_number>
                            <face_value>10000</face_value>
                            <currency>643</currency>
                            <denomination_id>1</denomination_id>
                            <dispenser_type>DSTPCASS</dispenser_type>
                        </atm_dispenser>
                        <atm_dispenser id="dispenser_2">
                            <disp_number>5678</disp_number>
                            <face_value>50000</face_value>
                            <currency>643</currency>
                            <denomination_id>1</denomination_id>
                            <dispenser_type>DSTPHOPP</dispenser_type>
                        </atm_dispenser>
                    </atm_terminal>
                </terminal>
            </merchant>
        </contract>
    </customer>
</application>
</soapenv:Body>
</soapenv:Envelope>
